src/test/resources/validate-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://www.gitb.com/vs/v1/" xmlns:v11="http://www.gitb.com/core/v1/">
    <soapenv:Header/>
    <soapenv:Body>
        <v1:ValidateRequest>
            <sessionId>test-pipeline-uuid</sessionId>
            <input name="ldes-url" embeddingMethod="STRING">
                <!-- Provide the input as-is. -->
                <v11:value>http://ldes-server:8080/verkeersmetingen</v11:value>
            </input>
            <input name="shacl-shape" embeddingMethod="STRING">
                <v11:value><![CDATA[
@prefix sh: <http://www.w3.org/ns/shacl#> .
@prefix xsd: <http://www.w3.org/2001/XMLSchema#> .
@prefix rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> .
@prefix verkeers: <https://data.vlaanderen.be/ns/verkeersmetingen#> .
@prefix vsds: <https://implementatie.data.vlaanderen.be/ns/vsds-verkeersmetingen#> .
@prefix geo: <http://www.opengis.net/ont/geosparql#> .
@prefix time: <http://www.w3.org/2006/time#> .

[] a sh:NodeShape ;
    sh:targetClass verkeers:Verkeersmeting ;
    sh:property [
        sh:path <http://def.isotc211.org/iso19156/2011/Observation#OM_Observation.result> ;
        sh:class <http://www.w3.org/ns/sosa/sensor> ;
    ] ;
    sh:property [
        sh:path geo:asWKT ;
        sh:minCount 10 ;
    ] ;
.
                ]]></v11:value>
            </input>
        </v1:ValidateRequest>
    </soapenv:Body>
</soapenv:Envelope>